# реализация с помощью однострочного вывода данных использую ESCAPE символы \n и \t
print("\t *\t\t****  *****  ****  *\t *\n\t* *\t    *  *\t*\t *\t   **   **\n   *   *\t****\t*\t ****  * * * *\n  * *** *\t*\t    *\t *\t   *  *  *\n *\t\t *\t*\t    *\t ****  *\t *\n")
# второй варинат с использованием многострочных литераторов
print("""
  ******  ****  *****  *   *  *   *
       *  *  *  *   *  *  **  *   * 
  ******  *  *  *****  * * *  *****
       *  *  *  *      **  *  *   * 
  ******  ****  *      *   *  *   *
  
  """)